Blazedemo_Dashboard/statistics.json
{
  "https://blazedemo.com/purchase.php" : {
    "transaction" : "https://blazedemo.com/purchase.php",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 616.0,
    "medianResTime" : 616.0,
    "minResTime" : 616.0,
    "maxResTime" : 616.0,
    "pct1ResTime" : 616.0,
    "pct2ResTime" : 616.0,
    "pct3ResTime" : 616.0,
    "throughput" : 1.6233766233766236,
    "receivedKBytesPerSec" : 12.16898336038961,
    "sentKBytesPerSec" : 8.578213778409092
  },
  "https://blazedemo.com/reserve.php-0" : {
    "transaction" : "https://blazedemo.com/reserve.php-0",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 989.0,
    "medianResTime" : 989.0,
    "minResTime" : 989.0,
    "maxResTime" : 989.0,
    "pct1ResTime" : 989.0,
    "pct2ResTime" : 989.0,
    "pct3ResTime" : 989.0,
    "throughput" : 1.0111223458038423,
    "receivedKBytesPerSec" : 7.303976554600607,
    "sentKBytesPerSec" : 0.8501722067745198
  },
  "https://blazedemo.com/purchase.php-5" : {
    "transaction" : "https://blazedemo.com/purchase.php-5",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 113.0,
    "medianResTime" : 113.0,
    "minResTime" : 113.0,
    "maxResTime" : 113.0,
    "pct1ResTime" : 113.0,
    "pct2ResTime" : 113.0,
    "pct3ResTime" : 113.0,
    "throughput" : 8.849557522123893,
    "receivedKBytesPerSec" : 1.512375553097345,
    "sentKBytesPerSec" : 7.821142146017699
  },
  "https://blazedemo.com/purchase.php-4" : {
    "transaction" : "https://blazedemo.com/purchase.php-4",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 101.0,
    "medianResTime" : 101.0,
    "minResTime" : 101.0,
    "maxResTime" : 101.0,
    "pct1ResTime" : 101.0,
    "pct2ResTime" : 101.0,
    "pct3ResTime" : 101.0,
    "throughput" : 9.900990099009901,
    "receivedKBytesPerSec" : 1.711401608910891,
    "sentKBytesPerSec" : 8.750386757425742
  },
  "https://blazedemo.com/reserve.php-3" : {
    "transaction" : "https://blazedemo.com/reserve.php-3",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 191.0,
    "medianResTime" : 191.0,
    "minResTime" : 191.0,
    "maxResTime" : 191.0,
    "pct1ResTime" : 191.0,
    "pct2ResTime" : 191.0,
    "pct3ResTime" : 191.0,
    "throughput" : 5.235602094240838,
    "receivedKBytesPerSec" : 201.8979057591623,
    "sentKBytesPerSec" : 4.182346204188482
  },
  "https://blazedemo.com/reserve.php-4" : {
    "transaction" : "https://blazedemo.com/reserve.php-4",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 483.0,
    "medianResTime" : 483.0,
    "minResTime" : 483.0,
    "maxResTime" : 483.0,
    "pct1ResTime" : 483.0,
    "pct2ResTime" : 483.0,
    "pct3ResTime" : 483.0,
    "throughput" : 2.070393374741201,
    "receivedKBytesPerSec" : 256.3062079451346,
    "sentKBytesPerSec" : 1.651866589026915
  },
  "https://blazedemo.com/reserve.php-1" : {
    "transaction" : "https://blazedemo.com/reserve.php-1",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 239.0,
    "medianResTime" : 239.0,
    "minResTime" : 239.0,
    "maxResTime" : 239.0,
    "pct1ResTime" : 239.0,
    "pct2ResTime" : 239.0,
    "pct3ResTime" : 239.0,
    "throughput" : 4.184100418410042,
    "receivedKBytesPerSec" : 343.1003203451883,
    "sentKBytesPerSec" : 3.41183969665272
  },
  "https://blazedemo.com/confirmation.php" : {
    "transaction" : "https://blazedemo.com/confirmation.php",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 447.0,
    "medianResTime" : 447.0,
    "minResTime" : 447.0,
    "maxResTime" : 447.0,
    "pct1ResTime" : 447.0,
    "pct2ResTime" : 447.0,
    "pct3ResTime" : 447.0,
    "throughput" : 2.237136465324385,
    "receivedKBytesPerSec" : 14.72708682885906,
    "sentKBytesPerSec" : 12.125104865771812
  },
  "https://blazedemo.com/reserve.php-2" : {
    "transaction" : "https://blazedemo.com/reserve.php-2",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 326.0,
    "medianResTime" : 326.0,
    "minResTime" : 326.0,
    "maxResTime" : 326.0,
    "pct1ResTime" : 326.0,
    "pct2ResTime" : 326.0,
    "pct3ResTime" : 326.0,
    "throughput" : 3.067484662576687,
    "receivedKBytesPerSec" : 86.81520801380368,
    "sentKBytesPerSec" : 2.4444018404907975
  },
  "https://blazedemo.com/reserve.php-5" : {
    "transaction" : "https://blazedemo.com/reserve.php-5",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 249.0,
    "medianResTime" : 249.0,
    "minResTime" : 249.0,
    "maxResTime" : 249.0,
    "pct1ResTime" : 249.0,
    "pct2ResTime" : 249.0,
    "pct3ResTime" : 249.0,
    "throughput" : 4.016064257028112,
    "receivedKBytesPerSec" : 15.950520833333334,
    "sentKBytesPerSec" : 3.2120670180722892
  },
  "https://blazedemo.com/purchase.php-3" : {
    "transaction" : "https://blazedemo.com/purchase.php-3",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 110.0,
    "medianResTime" : 110.0,
    "minResTime" : 110.0,
    "maxResTime" : 110.0,
    "pct1ResTime" : 110.0,
    "pct2ResTime" : 110.0,
    "pct3ResTime" : 110.0,
    "throughput" : 9.09090909090909,
    "receivedKBytesPerSec" : 1.5625,
    "sentKBytesPerSec" : 8.034446022727273
  },
  "https://blazedemo.com/purchase.php-2" : {
    "transaction" : "https://blazedemo.com/purchase.php-2",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 101.0,
    "medianResTime" : 101.0,
    "minResTime" : 101.0,
    "maxResTime" : 101.0,
    "pct1ResTime" : 101.0,
    "pct2ResTime" : 101.0,
    "pct3ResTime" : 101.0,
    "throughput" : 9.900990099009901,
    "receivedKBytesPerSec" : 1.7017326732673266,
    "sentKBytesPerSec" : 8.731048886138613
  },
  "https://blazedemo.com/purchase.php-1" : {
    "transaction" : "https://blazedemo.com/purchase.php-1",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 42.0,
    "medianResTime" : 42.0,
    "minResTime" : 42.0,
    "maxResTime" : 42.0,
    "pct1ResTime" : 42.0,
    "pct2ResTime" : 42.0,
    "pct3ResTime" : 42.0,
    "throughput" : 23.809523809523807,
    "receivedKBytesPerSec" : 5.97563244047619,
    "sentKBytesPerSec" : 20.57756696428571
  },
  "https://blazedemo.com/purchase.php-0" : {
    "transaction" : "https://blazedemo.com/purchase.php-0",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 493.0,
    "medianResTime" : 493.0,
    "minResTime" : 493.0,
    "maxResTime" : 493.0,
    "pct1ResTime" : 493.0,
    "pct2ResTime" : 493.0,
    "pct3ResTime" : 493.0,
    "throughput" : 2.028397565922921,
    "receivedKBytesPerSec" : 13.301454741379311,
    "sentKBytesPerSec" : 1.7986181541582151
  },
  "https://blazedemo.com/confirmation.php-5" : {
    "transaction" : "https://blazedemo.com/confirmation.php-5",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 102.0,
    "medianResTime" : 102.0,
    "minResTime" : 102.0,
    "maxResTime" : 102.0,
    "pct1ResTime" : 102.0,
    "pct2ResTime" : 102.0,
    "pct3ResTime" : 102.0,
    "throughput" : 9.803921568627452,
    "receivedKBytesPerSec" : 1.6754748774509804,
    "sentKBytesPerSec" : 8.664598651960786
  },
  "https://blazedemo.com/confirmation.php-4" : {
    "transaction" : "https://blazedemo.com/confirmation.php-4",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 132.0,
    "medianResTime" : 132.0,
    "minResTime" : 132.0,
    "maxResTime" : 132.0,
    "pct1ResTime" : 132.0,
    "pct2ResTime" : 132.0,
    "pct3ResTime" : 132.0,
    "throughput" : 7.575757575757576,
    "receivedKBytesPerSec" : 1.309481534090909,
    "sentKBytesPerSec" : 6.6953716856060606
  },
  "https://blazedemo.com/confirmation.php-3" : {
    "transaction" : "https://blazedemo.com/confirmation.php-3",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 115.0,
    "medianResTime" : 115.0,
    "minResTime" : 115.0,
    "maxResTime" : 115.0,
    "pct1ResTime" : 115.0,
    "pct2ResTime" : 115.0,
    "pct3ResTime" : 115.0,
    "throughput" : 8.695652173913043,
    "receivedKBytesPerSec" : 1.4945652173913042,
    "sentKBytesPerSec" : 7.685122282608695
  },
  "https://blazedemo.com/confirmation.php-2" : {
    "transaction" : "https://blazedemo.com/confirmation.php-2",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 115.0,
    "medianResTime" : 115.0,
    "minResTime" : 115.0,
    "maxResTime" : 115.0,
    "pct1ResTime" : 115.0,
    "pct2ResTime" : 115.0,
    "pct3ResTime" : 115.0,
    "throughput" : 8.695652173913043,
    "receivedKBytesPerSec" : 1.4945652173913042,
    "sentKBytesPerSec" : 7.6681385869565215
  },
  "Test" : {
    "transaction" : "Test",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 2619.0,
    "medianResTime" : 2619.0,
    "minResTime" : 2619.0,
    "maxResTime" : 2619.0,
    "pct1ResTime" : 2619.0,
    "pct2ResTime" : 2619.0,
    "pct3ResTime" : 2619.0,
    "throughput" : 0.3818251240931653,
    "receivedKBytesPerSec" : 113.75927715731194,
    "sentKBytesPerSec" : 5.93879760882016
  },
  "https://blazedemo.com/confirmation.php-1" : {
    "transaction" : "https://blazedemo.com/confirmation.php-1",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 39.0,
    "medianResTime" : 39.0,
    "minResTime" : 39.0,
    "maxResTime" : 39.0,
    "pct1ResTime" : 39.0,
    "pct2ResTime" : 39.0,
    "pct3ResTime" : 39.0,
    "throughput" : 25.64102564102564,
    "receivedKBytesPerSec" : 6.4352964743589745,
    "sentKBytesPerSec" : 22.16045673076923
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 21,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 325.6190476190477,
    "medianResTime" : 191.0,
    "minResTime" : 39.0,
    "maxResTime" : 1556.0,
    "pct1ResTime" : 914.4000000000003,
    "pct2ResTime" : 1499.2999999999993,
    "pct3ResTime" : 1556.0,
    "throughput" : 0.3755297652044849,
    "receivedKBytesPerSec" : 10.655587234670339,
    "sentKBytesPerSec" : 0.5562744206112195
  },
  "https://blazedemo.com/reserve.php" : {
    "transaction" : "https://blazedemo.com/reserve.php",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1556.0,
    "medianResTime" : 1556.0,
    "minResTime" : 1556.0,
    "maxResTime" : 1556.0,
    "pct1ResTime" : 1556.0,
    "pct2ResTime" : 1556.0,
    "pct3ResTime" : 1556.0,
    "throughput" : 0.6426735218508997,
    "receivedKBytesPerSec" : 182.4270214090617,
    "sentKBytesPerSec" : 3.1167155366323906
  },
  "https://blazedemo.com/confirmation.php-0" : {
    "transaction" : "https://blazedemo.com/confirmation.php-0",
    "sampleCount" : 1,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 279.0,
    "medianResTime" : 279.0,
    "minResTime" : 279.0,
    "maxResTime" : 279.0,
    "pct1ResTime" : 279.0,
    "pct2ResTime" : 279.0,
    "pct3ResTime" : 279.0,
    "throughput" : 3.5842293906810037,
    "receivedKBytesPerSec" : 20.23129480286738,
    "sentKBytesPerSec" : 3.6647345430107525
  }
}