Nopcommerce_Dashboard/statistics.json
{
  "https://demo.nopcommerce.com/nikon-d5500-dslr" : {
    "transaction" : "https://demo.nopcommerce.com/nikon-d5500-dslr",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 1081.9899999999998,
    "medianResTime" : 894.5,
    "minResTime" : 247.0,
    "maxResTime" : 2783.0,
    "pct1ResTime" : 1986.7000000000003,
    "pct2ResTime" : 2210.95,
    "pct3ResTime" : 2778.439999999998,
    "throughput" : 6.114338122898197,
    "receivedKBytesPerSec" : 310.6126160768878,
    "sentKBytesPerSec" : 4.914160424946499
  },
  "https://demo.nopcommerce.com/asus-n551jk-xo076h-laptop" : {
    "transaction" : "https://demo.nopcommerce.com/asus-n551jk-xo076h-laptop",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 532.59,
    "medianResTime" : 356.5,
    "minResTime" : 204.0,
    "maxResTime" : 1959.0,
    "pct1ResTime" : 1454.4,
    "pct2ResTime" : 1622.2499999999995,
    "pct3ResTime" : 1958.1099999999994,
    "throughput" : 6.3271116735210375,
    "receivedKBytesPerSec" : 255.11013128756724,
    "sentKBytesPerSec" : 5.116062954761151
  },
  "https://demo.nopcommerce.com/camera-photo" : {
    "transaction" : "https://demo.nopcommerce.com/camera-photo",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 618.0999999999998,
    "medianResTime" : 434.0,
    "minResTime" : 178.0,
    "maxResTime" : 2031.0,
    "pct1ResTime" : 1498.000000000001,
    "pct2ResTime" : 1664.0499999999995,
    "pct3ResTime" : 2030.5299999999997,
    "throughput" : 6.10798924993892,
    "receivedKBytesPerSec" : 141.2755247144515,
    "sentKBytesPerSec" : 4.885198433300757
  },
  "https://demo.nopcommerce.com/electronics" : {
    "transaction" : "https://demo.nopcommerce.com/electronics",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 595.8800000000001,
    "medianResTime" : 386.0,
    "minResTime" : 158.0,
    "maxResTime" : 1908.0,
    "pct1ResTime" : 1519.5000000000002,
    "pct2ResTime" : 1857.049999999999,
    "pct3ResTime" : 1907.97,
    "throughput" : 6.1409972979611895,
    "receivedKBytesPerSec" : 114.65169990481455,
    "sentKBytesPerSec" : 4.905601357160403
  },
  "https://demo.nopcommerce.com/desktops" : {
    "transaction" : "https://demo.nopcommerce.com/desktops",
    "sampleCount" : 100,
    "errorCount" : 39,
    "errorPct" : 39.0,
    "meanResTime" : 511.0199999999999,
    "medianResTime" : 507.0,
    "minResTime" : 272.0,
    "maxResTime" : 1374.0,
    "pct1ResTime" : 664.7000000000002,
    "pct2ResTime" : 919.2499999999984,
    "pct3ResTime" : 1372.7999999999993,
    "throughput" : 6.620324395895399,
    "receivedKBytesPerSec" : 95.38633213339953,
    "sentKBytesPerSec" : 3.2843015557762327
  },
  "Test" : {
    "transaction" : "Test",
    "sampleCount" : 100,
    "errorCount" : 39,
    "errorPct" : 39.0,
    "meanResTime" : 4001.039999999999,
    "medianResTime" : 3921.0,
    "minResTime" : 2828.0,
    "maxResTime" : 6251.0,
    "pct1ResTime" : 4786.400000000001,
    "pct2ResTime" : 5211.899999999998,
    "pct3ResTime" : 6242.079999999995,
    "throughput" : 5.10073960724305,
    "receivedKBytesPerSec" : 1050.5541076893649,
    "sentKBytesPerSec" : 26.384970351951033
  },
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 700,
    "errorCount" : 39,
    "errorPct" : 5.571429,
    "meanResTime" : 571.5771428571427,
    "medianResTime" : 393.5,
    "minResTime" : 158.0,
    "maxResTime" : 2783.0,
    "pct1ResTime" : 1373.8,
    "pct2ResTime" : 1772.8999999999999,
    "pct3ResTime" : 2120.6400000000003,
    "throughput" : 11.820131372317253,
    "receivedKBytesPerSec" : 347.78394963357596,
    "sentKBytesPerSec" : 8.734694512926158
  },
  "https://demo.nopcommerce.com/notebooks" : {
    "transaction" : "https://demo.nopcommerce.com/notebooks",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 410.64,
    "medianResTime" : 248.5,
    "minResTime" : 187.0,
    "maxResTime" : 2085.0,
    "pct1ResTime" : 627.9000000000003,
    "pct2ResTime" : 1997.9999999999998,
    "pct3ResTime" : 2084.3799999999997,
    "throughput" : 6.341958396752917,
    "receivedKBytesPerSec" : 190.0788979261796,
    "sentKBytesPerSec" : 5.028974822425164
  },
  "https://demo.nopcommerce.com/build-your-own-computer" : {
    "transaction" : "https://demo.nopcommerce.com/build-your-own-computer",
    "sampleCount" : 100,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 250.82000000000008,
    "medianResTime" : 206.0,
    "minResTime" : 168.0,
    "maxResTime" : 514.0,
    "pct1ResTime" : 420.5000000000001,
    "pct2ResTime" : 444.95,
    "pct3ResTime" : 513.8199999999999,
    "throughput" : 7.103281716152862,
    "receivedKBytesPerSec" : 203.58733762341953,
    "sentKBytesPerSec" : 4.778899257707061
  }
}